
[
  {"id": 1, "topic": "Streetlight Issues", "content": "To issue a complaint about a non-functional or broken streetlight in India: 1. Note the exact location (street/landmark). 2. Take a photo if possible. 3. Visit your city municipal corporation's official website or use their mobile app (many cities have online complaint portals). 4. Select the 'Streetlight' or 'Electrical' complaint category and fill in the details. 5. You can also call the municipal helpline number (e.g., 1912 in many Indian cities) or visit the local ward office. 6. Keep your complaint reference number for tracking. This process helps ensure quick repair and improved public safety."},
  {"id": 2, "topic": "How do I complain about a streetlight not working?", "content": "You can complain about a streetlight not working by calling your municipal helpline (e.g., 1912), using the official city app, or submitting a complaint on the municipal website. Provide the pole number or exact location for faster service."},
  {"id": 3, "topic": "Where to report streetlight outage in India?", "content": "Report streetlight outages to your local municipal corporation. Most cities have online portals or helpline numbers. You can also visit your local ward office."},
  {"id": 4, "topic": "What details are needed for a streetlight complaint?", "content": "You should provide the exact location, pole number (if available), and a photo of the faulty streetlight. Mention if the area is completely dark or if it is a safety concern."},
  {"id": 5, "topic": "Can I use WhatsApp to complain about civic issues?", "content": "Many Indian cities now accept civic complaints via WhatsApp. Check your city municipal website for the official WhatsApp number and send your complaint with details and photos."},
  {"id": 6, "topic": "How to track my streetlight complaint?", "content": "After submitting your complaint, you will receive a reference number. Use this on the municipal website or app to track the status of your complaint."},
  {"id": 7, "topic": "What if my streetlight complaint is not resolved?", "content": "If your complaint is not resolved within a reasonable time, escalate it by contacting the ward officer or submitting a grievance to the municipal commissioner via email or in person."},
  {"id": 8, "topic": "How to report water supply issues in India?", "content": "Contact your city water board via their helpline, website, or app. Provide your address, nature of the issue (no water, low pressure, contamination), and duration of the problem."},
  {"id": 9, "topic": "How to complain about garbage not collected?", "content": "Call your municipal helpline, use the city app, or submit a complaint online. Provide your address, type of waste, and how long it has not been collected. Attach photos if possible."},
  {"id": 10, "topic": "Where to report potholes in my city?", "content": "Report potholes to the municipal engineering department using the city app, website, or helpline. Provide the road name, nearest landmark, and a photo for quick action."},
  {"id": 11, "topic": "How to complain about noise pollution?", "content": "Call your local police station or pollution control board. Provide details about the source, timing, and location of the noise. Many cities have online forms for noise complaints."},
  {"id": 12, "topic": "How to report stray animals?", "content": "Contact the municipal animal control cell or helpline. Provide the location, type of animal, and nature of the issue (injured, aggressive, nuisance, etc.)."},
  {"id": 13, "topic": "How to report open manholes?", "content": "Report open or broken manholes to the municipal engineering or sanitation department. Use the city app, helpline, or website and provide the exact location."},
  {"id": 14, "topic": "How to complain about water contamination?", "content": "Contact your city water board or municipal health department. Provide your address, describe the issue (color, smell, taste), and attach a photo if possible."},
  {"id": 15, "topic": "How to report illegal dumping of waste?", "content": "Report illegal dumping to the municipal enforcement cell or pollution control board. Provide location, type of waste, and photos if possible."},
  {"id": 16, "topic": "How to complain about broken footpaths?", "content": "Contact the municipal engineering department via app, website, or helpline. Provide the location and describe the hazard."},
  {"id": 17, "topic": "How to report blocked drains?", "content": "Call the municipal drainage department or use the city app. Provide the location and describe the severity (overflowing, foul smell, etc.)."},
  {"id": 18, "topic": "How to report public toilet issues?", "content": "Contact the municipal health department or use the city app. Provide the location and describe the problem (unclean, no water, broken doors, etc.)."},
  {"id": 19, "topic": "How to report traffic signal malfunction?", "content": "Call the traffic police helpline or use the city app. Provide the intersection name and describe the issue (not working, wrong timing, etc.)."},
  {"id": 20, "topic": "How to complain about illegal parking?", "content": "Report illegal parking to the traffic police via helpline, app, or website. Provide vehicle number, location, and a photo if possible."},
  {"id": 21, "topic": "How to report air pollution?", "content": "Contact the state pollution control board or use the National Air Quality Index app. Provide details about the source and location."},
  {"id": 22, "topic": "How to report encroachment on public land?", "content": "Contact the municipal enforcement cell. Provide the location, type of encroachment, and photos if possible."},
  {"id": 23, "topic": "How to report waterlogging during rains?", "content": "Call the municipal drainage department or use the city app. Provide the location and describe the severity."},
  {"id": 24, "topic": "How to report broken playground equipment?", "content": "Contact the parks and recreation department. Provide the park name, location, and describe the issue."},
  {"id": 25, "topic": "How to report public transport issues?", "content": "Contact the city transport authority via helpline, app, or website. Provide bus/train number, route, and describe the issue (delay, overcrowding, etc.)."},
  {"id": 26, "topic": "How to report sanitation issues in markets?", "content": "Contact the municipal market committee or sanitation department. Provide the market name, location, and describe the problem."},
  {"id": 27, "topic": "How to report unsafe construction?", "content": "Contact the municipal building department. Provide the address, describe the hazard, and attach photos if possible."},
  {"id": 28, "topic": "How to report lack of accessibility in public buildings?", "content": "Contact the municipal engineering department. Provide the building name, location, and describe the accessibility issue (no ramp, no lift, etc.)."},
  {"id": 29, "topic": "How to report broken public benches?", "content": "Contact the parks and recreation department. Provide the location and describe the damage."},
  {"id": 30, "topic": "How to report issues with public Wi-Fi?", "content": "Contact the IT cell of your municipal corporation. Provide the location and describe the problem (no signal, slow speed, etc.)."},
  {"id": 31, "topic": "How to report mosquito breeding sites?", "content": "Contact the municipal health department. Provide the location and describe the site (stagnant water, open drains, etc.)."},
  {"id": 32, "topic": "How to report broken water pipes?", "content": "Contact the city water board. Provide the location and describe the issue (leak, burst, etc.)."},
  {"id": 33, "topic": "How to report open electrical boxes?", "content": "Contact the electricity board. Provide the location and describe the hazard."},
  {"id": 34, "topic": "How to report issues with public parks?", "content": "Contact the parks and gardens department. Provide the park name, location, and describe the issue (broken swings, uncut grass, etc.)."},
  {"id": 35, "topic": "How to report issues with public libraries?", "content": "Contact the education department. Provide the library name, location, and describe the issue (lack of books, poor maintenance, etc.)."},
  {"id": 36, "topic": "How to report issues with public fountains?", "content": "Contact the parks and gardens department. Provide the location and describe the issue (not working, dirty, etc.)."},
  {"id": 37, "topic": "How to report issues with public dustbins?", "content": "Contact the sanitation department. Provide the location and describe the issue (broken, missing, overflowing, etc.)."},
  {"id": 38, "topic": "How to report issues with public notice boards?", "content": "Contact the municipal information cell. Provide the location and describe the issue (missing, outdated, broken, etc.)."},
  {"id": 39, "topic": "How to report issues with public bicycle sharing?", "content": "Contact the transport department or service provider. Provide the station location and describe the issue (no cycles, broken dock, etc.)."},
  {"id": 40, "topic": "How to report issues with public gyms?", "content": "Contact the parks department. Provide the gym location and describe the issue (broken equipment, unclean, etc.)."}
]

