[
  {"id": 1, "topic": "Streetlight lighting lamp electric pole bulb illumination", "content": "Municipal lighting department handles streetlight repairs and maintenance. Report non-functional lights with exact location, pole number, and photos. Use city mobile app, call helpline 1912, visit municipal website, or go to local ward office. Common issues include bulb failure, pole damage, electrical faults, timer problems."},
  {"id": 2, "topic": "Water supply drinking tap pipeline shortage pressure contamination", "content": "Water board and municipal corporation manage water supply issues. Report water cuts, low pressure, contamination, pipe bursts, tanker delays. Contact through water helpline, city app, municipal website, or local water office. Provide address, problem type, and duration."},
  {"id": 3, "topic": "Garbage waste collection trash refuse disposal bin overflowing", "content": "Sanitation department handles waste management and collection. Report missed garbage pickups, overflowing bins, illegal dumping, unclean areas. Use municipal app, call sanitation helpline, or contact local ward office with location details and photos."},
  {"id": 4, "topic": "Pothole road damage crater hole asphalt street repair", "content": "Municipal engineering department repairs roads and potholes. Report with exact road name, nearest landmark, size description, and photos. Use city app, website, or engineering department helpline for quick action and tracking."},
  {"id": 5, "topic": "Noise pollution loud sound speaker music horn construction", "content": "Police station or pollution control board handles noise complaints. Report source, timing, location, and type of noise violation. Many cities have online noise complaint forms, or call local police station with details."},
  {"id": 6, "topic": "Stray animals dog cat cattle monkey pig street dangerous", "content": "Municipal animal control cell handles stray animal issues. Report location, animal type, behavior (aggressive, injured, nuisance). Contact animal helpline, municipal office, or local veterinary services for assistance."},
  {"id": 7, "topic": "Drain sewage blockage overflow smell manhole cover missing", "content": "Municipal drainage department manages sewage and drainage systems. Report blocked drains, overflows, open manholes, foul smell. Use city app or call municipal helpline immediately with exact location details."},
  {"id": 8, "topic": "Public transport bus train metro auto rickshaw delay overcrowding", "content": "Transport authority handles public transport complaints. Report delays, overcrowding, safety concerns, misbehavior, cleanliness issues. Contact through official transport helpline with vehicle number, route, and incident details."},
  {"id": 9, "topic": "Traffic signal light junction crossing zebra malfunction timing", "content": "Traffic police manage traffic signals and road crossings. Report malfunctioning lights, wrong timing, missing zebra crossings, unsafe junctions. Call traffic helpline or submit complaint through traffic police app."},
  {"id": 10, "topic": "Illegal parking vehicle car bike footpath no-parking blocking", "content": "Traffic police handle parking violations and traffic management. Report with vehicle number, exact location, photos, and nature of violation. Contact traffic helpline or submit online complaint for action."},
  {"id": 11, "topic": "Park playground garden maintenance swing slide broken equipment", "content": "Parks and recreation department maintains public spaces and equipment. Report broken swings, damaged equipment, poor maintenance, safety hazards. Contact through municipal app, parks office, or local ward."},
  {"id": 12, "topic": "Public toilet restroom washroom cleanliness water facility maintenance", "content": "Municipal health department manages public toilet facilities. Report uncleanliness, lack of water, broken doors, non-functional facilities. Use city app, health helpline, or contact sanitation department."},
  {"id": 13, "topic": "Footpath pavement walkway broken tiles encroachment accessibility", "content": "Municipal engineering department handles footpath construction and maintenance. Report damages, encroachments, accessibility issues, broken tiles. Contact through official channels with location and photos."},
  {"id": 14, "topic": "Building construction illegal unsafe violation permit unauthorized", "content": "Municipal building department monitors construction activities. Report illegal construction, safety violations, unauthorized structures, building code violations. Contact building control office or municipal enforcement cell."},
  {"id": 15, "topic": "Fire safety hydrant extinguisher emergency access equipment", "content": "Fire department handles fire safety and emergency services. Report blocked fire hydrants, missing safety equipment, fire hazards, unsafe buildings. Contact fire helpline for immediate action and inspection."},
  {"id": 16, "topic": "Air pollution smoke dust emission industrial vehicle burning", "content": "Pollution control board manages air quality and environmental protection. Report excessive emissions, dust pollution, waste burning, industrial violations. Contact with evidence, location, and time details."},
  {"id": 17, "topic": "Market cleanliness vendor hygiene food safety illegal hawker", "content": "Municipal market committee handles market-related issues. Report hygiene problems, illegal vendors, food safety violations, overcrowding. Contact market office, health department, or enforcement cell."},
  {"id": 18, "topic": "Electricity power outage cut failure transformer wire dangerous", "content": "Electricity board handles power supply and electrical safety. Report power outages, dangerous hanging wires, transformer problems, electrical hazards. Contact electricity helpline with area details and emergency information."},
  {"id": 19, "topic": "School education facility infrastructure maintenance teacher shortage", "content": "Education department manages school facilities and services. Report infrastructure problems, teacher shortages, facility maintenance, safety issues. Contact education board, district education office, or school management."},
  {"id": 20, "topic": "Hospital health center medical facility ambulance service", "content": "Health department manages public healthcare facilities. Report facility issues, service problems, ambulance delays, medical equipment problems. Contact health helpline, district health office, or hospital administration."},
  {"id": 21, "topic": "Robbery theft burglary crime stealing mugging snatching", "content": "Police department handles robbery and theft cases. Immediately call 100 for emergency response. File FIR at nearest police station with details of stolen items, time, location, suspect description. Keep complaint receipt for insurance claims."},
  {"id": 22, "topic": "Murder homicide killing violence assault attack", "content": "Police and emergency services handle murder cases. Immediately call 100 for police and 108 for ambulance. Do not touch crime scene. File FIR at police station. Contact nearest hospital if victim is alive. Cooperate with investigation."},
  {"id": 23, "topic": "Vehicle breakdown car bike auto emergency roadside assistance", "content": "Call vehicle manufacturer helpline, insurance roadside assistance, or local mechanic. For highway breakdown, contact highway police 1033. Keep hazard lights on, park safely. Contact towing service if needed."},
  {"id": 24, "topic": "Medical emergency ambulance hospital cardiac stroke accident", "content": "Call 108 for free ambulance service across India. For private ambulance, contact local hospitals. Keep patient calm, check breathing. Contact nearest hospital emergency department. Have patient ID and insurance ready."},
  {"id": 25, "topic": "Fire emergency burning building house forest disaster", "content": "Immediately call 101 for fire department. Evacuate area safely. Do not use water on electrical fires. Alert neighbors. Contact local fire station. Report to municipal disaster management cell for major fires."},
  {"id": 26, "topic": "Domestic violence abuse harassment women children safety", "content": "Call 1091 for women helpline or 100 for police. Contact nearest police station to file complaint. Reach out to local women protection officer. Contact NGOs for support. Use 181 for women in distress helpline."},
  {"id": 27, "topic": "Kidnapping missing person abduction child trafficking", "content": "Immediately call 100 for police emergency. File missing person report at police station within 24 hours. Contact 1098 for child helpline if minor involved. Share recent photos, details. Alert local community and media."},
  {"id": 28, "topic": "Accident road vehicle collision injury traffic emergency", "content": "Call 100 for police and 108 for ambulance. Do not move seriously injured persons. Clear traffic if safe. Exchange insurance details. Take photos of scene. File FIR if major accident. Contact insurance company."},
  {"id": 29, "topic": "Fraud cyber crime online banking digital scam cheating", "content": "Report to cyber crime police station or online at cybercrime.gov.in. Call cyber helpline 1930. Block cards immediately if banking fraud. File FIR with evidence. Contact bank/service provider. Save all communication records."},
  {"id": 30, "topic": "Drug abuse narcotics substance illegal trafficking addiction", "content": "Report drug trafficking to police or narcotics control bureau. Call 100 for immediate action. Contact de-addiction centers for treatment. Report to local excise department. Contact family counseling services."},
  {"id": 31, "topic": "Electricity outage power cut emergency electrical hazard", "content": "Report to electricity board helpline or state electricity emergency number. For dangerous hanging wires, call 100 and electricity board immediately. Keep away from fallen wires. Contact local electricity office."},
  {"id": 32, "topic": "Gas leak LPG cylinder emergency cooking domestic explosion", "content": "Turn off gas supply immediately. Ventilate area, no flames or electrical switches. Evacuate if needed. Call gas company emergency number. Contact fire department 101 if major leak. Check for gas smell regularly."},
  {"id": 33, "topic": "Natural disaster flood earthquake cyclone tsunami emergency", "content": "Follow disaster management authority instructions. Call 1078 for disaster helpline. Evacuate to safe areas. Contact local disaster management office. Listen to official radio/TV updates. Have emergency kit ready."},
  {"id": 34, "topic": "Terrorism terrorist attack bomb threat security emergency", "content": "Immediately call 100 for police. Evacuate area calmly. Do not touch suspicious objects. Contact local ATS (Anti-Terrorism Squad). Follow police instructions. Report suspicious activities to authorities."},
  {"id": 35, "topic": "Industrial accident chemical leak factory workplace safety", "content": "Call 100 for police, 101 for fire, 108 for ambulance. Evacuate immediate area. Contact factory management and pollution control board. Report to labor department and factory inspector. Seek medical attention if exposed."},
  {"id": 36, "topic": "Food poisoning contamination outbreak public health emergency", "content": "Contact health department immediately. Call 108 if severe symptoms. Report to food safety officer. File complaint with local health authority. Preserve food samples. Contact hospital for treatment."},
  {"id": 37, "topic": "Animal attack wild animal dangerous pet rabies bite", "content": "Call 100 for police and 108 for ambulance. Clean wound immediately with soap. Contact nearest hospital for anti-rabies treatment. Report to forest department if wild animal. Contact municipal animal control."},
  {"id": 38, "topic": "Building collapse structural failure earthquake damage emergency", "content": "Call 100 for police, 101 for fire, 108 for ambulance. Evacuate area immediately. Contact municipal engineering department. Report to disaster management authority. Contact building owner and insurance company."},
  {"id": 39, "topic": "Water contamination poisoning supply emergency health hazard", "content": "Stop using contaminated water immediately. Contact water board and health department. Call health helpline. Use bottled water. Report to pollution control board. Contact local medical officer for health guidance."},
  {"id": 40, "topic": "Child abuse exploitation trafficking minor safety protection", "content": "Call 1098 for child helpline immediately. Contact police station to file FIR. Report to child welfare committee. Contact district child protection officer. Reach out to NGOs for child protection and support."},
  {"id": 41, "topic": "Cemetery crematorium burial ground maintenance facility", "content": "Municipal corporation manages burial and cremation facilities. Report maintenance issues, facility problems, service complaints. Contact municipal office, health department, or facility management."},
  {"id": 42, "topic": "Library public reading facility book maintenance infrastructure", "content": "Education or cultural department manages public libraries. Report facility issues, book shortages, maintenance problems, infrastructure needs. Contact education department or library administration."},
  {"id": 43, "topic": "Community hall wedding function booking facility maintenance", "content": "Municipal community services handle community halls and booking. Report booking issues, facility problems, maintenance needs, cleanliness concerns. Contact community services office or municipal corporation."},
  {"id": 44, "topic": "Sports facility stadium ground equipment maintenance playground", "content": "Sports department manages sports facilities and equipment. Report equipment damage, ground maintenance, facility problems, safety issues. Contact sports department, municipal office, or facility management."},
  {"id": 45, "topic": "Bridge flyover overpass underpass maintenance safety structural", "content": "Municipal engineering department handles bridge infrastructure. Report structural issues, safety concerns, maintenance needs, damaged railings. Contact engineering department immediately for inspection."},
  {"id": 46, "topic": "Canal river water body pollution cleaning maintenance encroachment", "content": "Water resources department manages water bodies and canals. Report pollution, illegal encroachment, maintenance issues, cleaning needs. Contact department with location details and evidence."},
  {"id": 47, "topic": "Tree pruning cutting plantation maintenance horticulture landscaping", "content": "Horticulture department manages tree plantation and maintenance. Report dangerous overhanging branches, illegal tree cutting, plantation requests. Contact horticulture office with location and specific requirements."},
  {"id": 48, "topic": "Slum rehabilitation housing development infrastructure basic services", "content": "Slum rehabilitation authority handles housing and infrastructure development. Report infrastructure problems, service issues, housing complaints. Contact rehabilitation office or municipal corporation."},
  {"id": 49, "topic": "Disaster management flood earthquake fire emergency preparedness", "content": "Disaster management cell handles emergency preparedness and response. Report disaster situations, preparedness issues, emergency service problems. Contact emergency helpline or disaster management office."},
  {"id": 50, "topic": "Pollution control waste dumping river contamination environment", "content": "Pollution control board monitors environmental violations and protection. Report illegal waste dumping, water contamination, environmental damage. Submit complaints with evidence and location details."},
  {"id": 51, "topic": "Electric pole bulb illumination", "content": "Municipal lighting department handles streetlight repairs and maintenance. Report non-functional lights with exact location, pole number, and photos. Use city mobile app, call helpline 1912, visit municipal website, or go to local ward office. Common issues include bulb failure, pole damage, electrical faults, timer problems."},
  {"id": 2, "topic": "Water supply drinking tap pipeline shortage pressure contamination", "content": "Water board and municipal corporation manage water supply issues. Report water cuts, low pressure, contamination, pipe bursts, tanker delays. Contact through water helpline, city app, municipal website, or local water office. Provide address, problem type, and duration."},
  {"id": 3, "topic": "Garbage waste collection trash refuse disposal bin overflowing", "content": "Sanitation department handles waste management and collection. Report missed garbage pickups, overflowing bins, illegal dumping, unclean areas. Use municipal app, call sanitation helpline, or contact local ward office with location details and photos."},
  {"id": 4, "topic": "Pothole road damage crater hole asphalt street repair", "content": "Municipal engineering department repairs roads and potholes. Report with exact road name, nearest landmark, size description, and photos. Use city app, website, or engineering department helpline for quick action and tracking."},
  {"id": 5, "topic": "Noise pollution loud sound speaker music horn construction", "content": "Police station or pollution control board handles noise complaints. Report source, timing, location, and type of noise violation. Many cities have online noise complaint forms, or call local police station with details."},
  {"id": 6, "topic": "Stray animals dog cat cattle monkey pig street dangerous", "content": "Municipal animal control cell handles stray animal issues. Report location, animal type, behavior (aggressive, injured, nuisance). Contact animal helpline, municipal office, or local veterinary services for assistance."},
  {"id": 7, "topic": "Drain sewage blockage overflow smell manhole cover missing", "content": "Municipal drainage department manages sewage and drainage systems. Report blocked drains, overflows, open manholes, foul smell. Use city app or call municipal helpline immediately with exact location details."},
  {"id": 8, "topic": "Public transport bus train metro auto rickshaw delay overcrowding", "content": "Transport authority handles public transport complaints. Report delays, overcrowding, safety concerns, misbehavior, cleanliness issues. Contact through official transport helpline with vehicle number, route, and incident details."},
  {"id": 9, "topic": "Traffic signal light junction crossing zebra malfunction timing", "content": "Traffic police manage traffic signals and road crossings. Report malfunctioning lights, wrong timing, missing zebra crossings, unsafe junctions. Call traffic helpline or submit complaint through traffic police app."},
  {"id": 10, "topic": "Illegal parking vehicle car bike footpath no-parking blocking", "content": "Traffic police handle parking violations and traffic management. Report with vehicle number, exact location, photos, and nature of violation. Contact traffic helpline or submit online complaint for action."},
  {"id": 11, "topic": "Park playground garden maintenance swing slide broken equipment", "content": "Parks and recreation department maintains public spaces and equipment. Report broken swings, damaged equipment, poor maintenance, safety hazards. Contact through municipal app, parks office, or local ward."},
  {"id": 12, "topic": "Public toilet restroom washroom cleanliness water facility maintenance", "content": "Municipal health department manages public toilet facilities. Report uncleanliness, lack of water, broken doors, non-functional facilities. Use city app, health helpline, or contact sanitation department."},
  {"id": 13, "topic": "Footpath pavement walkway broken tiles encroachment accessibility", "content": "Municipal engineering department handles footpath construction and maintenance. Report damages, encroachments, accessibility issues, broken tiles. Contact through official channels with location and photos."},
  {"id": 14, "topic": "Building construction illegal unsafe violation permit unauthorized", "content": "Municipal building department monitors construction activities. Report illegal construction, safety violations, unauthorized structures, building code violations. Contact building control office or municipal enforcement cell."},
  {"id": 15, "topic": "Fire safety hydrant extinguisher emergency access equipment", "content": "Fire department handles fire safety and emergency services. Report blocked fire hydrants, missing safety equipment, fire hazards, unsafe buildings. Contact fire helpline for immediate action and inspection."},
  {"id": 16, "topic": "Air pollution smoke dust emission industrial vehicle burning", "content": "Pollution control board manages air quality and environmental protection. Report excessive emissions, dust pollution, waste burning, industrial violations. Contact with evidence, location, and time details."},
  {"id": 17, "topic": "Market cleanliness vendor hygiene food safety illegal hawker", "content": "Municipal market committee handles market-related issues. Report hygiene problems, illegal vendors, food safety violations, overcrowding. Contact market office, health department, or enforcement cell."},
  {"id": 18, "topic": "Electricity power outage cut failure transformer wire dangerous", "content": "Electricity board handles power supply and electrical safety. Report power outages, dangerous hanging wires, transformer problems, electrical hazards. Contact electricity helpline with area details and emergency information."},
  {"id": 19, "topic": "School education facility infrastructure maintenance teacher shortage", "content": "Education department manages school facilities and services. Report infrastructure problems, teacher shortages, facility maintenance, safety issues. Contact education board, district education office, or school management."},
  {"id": 20, "topic": "Hospital health center medical facility ambulance service", "content": "Health department manages public healthcare facilities. Report facility issues, service problems, ambulance delays, medical equipment problems. Contact health helpline, district health office, or hospital administration."},
  {"id": 21, "topic": "Cemetery crematorium burial ground maintenance facility management", "content": "Municipal corporation manages burial and cremation facilities. Report maintenance issues, facility problems, service complaints. Contact municipal office, health department, or facility management."},
  {"id": 22, "topic": "Library public reading facility book maintenance infrastructure", "content": "Education or cultural department manages public libraries. Report facility issues, book shortages, maintenance problems, infrastructure needs. Contact education department or library administration."},
  {"id": 23, "topic": "Community hall wedding function booking facility maintenance", "content": "Municipal community services handle community halls and booking. Report booking issues, facility problems, maintenance needs, cleanliness concerns. Contact community services office or municipal corporation."},
  {"id": 24, "topic": "Sports facility stadium ground equipment maintenance playground", "content": "Sports department manages sports facilities and equipment. Report equipment damage, ground maintenance, facility problems, safety issues. Contact sports department, municipal office, or facility management."},
  {"id": 25, "topic": "Bridge flyover overpass underpass maintenance safety structural", "content": "Municipal engineering department handles bridge infrastructure. Report structural issues, safety concerns, maintenance needs, damaged railings. Contact engineering department immediately for inspection."},
  {"id": 26, "topic": "Canal river water body pollution cleaning maintenance encroachment", "content": "Water resources department manages water bodies and canals. Report pollution, illegal encroachment, maintenance issues, cleaning needs. Contact department with location details and evidence."},
  {"id": 27, "topic": "Tree pruning cutting plantation maintenance horticulture landscaping", "content": "Horticulture department manages tree plantation and maintenance. Report dangerous overhanging branches, illegal tree cutting, plantation requests. Contact horticulture office with location and specific requirements."},
  {"id": 28, "topic": "Slum rehabilitation housing development infrastructure basic services", "content": "Slum rehabilitation authority handles housing and infrastructure development. Report infrastructure problems, service issues, housing complaints. Contact rehabilitation office or municipal corporation."},
  {"id": 29, "topic": "Disaster management flood earthquake fire emergency preparedness", "content": "Disaster management cell handles emergency preparedness and response. Report disaster situations, preparedness issues, emergency service problems. Contact emergency helpline or disaster management office."},
  {"id": 30, "topic": "Pollution control waste dumping river contamination environment", "content": "Pollution control board monitors environmental violations and protection. Report illegal waste dumping, water contamination, environmental damage. Submit complaints with evidence and location details."},
  {"id": 31, "topic": "Revenue tax property assessment collection complaint billing", "content": "Revenue department handles property taxes and assessments. Report tax assessment issues, billing problems, collection complaints. Contact revenue office, municipal tax department, or collector office."},
  {"id": 32, "topic": "Birth death certificate registration vital statistics documentation", "content": "Registrar office handles vital statistics and certificate issuance. Report registration problems, certificate delays, documentation issues. Contact registrar office or municipal corporation."},
  {"id": 33, "topic": "Ration food distribution PDS shop complaint supply quality", "content": "Food and civil supplies department manages public distribution system. Report ration shop issues, food quality problems, distribution complaints. Contact food department or collector office."},
  {"id": 34, "topic": "Employment NREGA work scheme rural urban job guarantee", "content": "Employment department manages government job schemes and programs. Report work allocation issues, payment delays, scheme implementation problems. Contact employment office or district collector."},
  {"id": 35, "topic": "Police station law order crime safety security patrol", "content": "Police department handles law enforcement and public safety. Report crimes, safety issues, police misconduct, security concerns. Contact nearest police station or superintendent office."},
  {"id": 36, "topic": "Court justice legal system case hearing delay procedure", "content": "Judicial administration handles court operations and legal procedures. Report court facility issues, case delays, procedural problems. Contact court registrar or judicial administration office."},
  {"id": 37, "topic": "Banking finance ATM service complaint resolution transaction", "content": "Banking ombudsman handles banking service complaints. Report ATM problems, service issues, transaction disputes, complaint resolution. Contact bank customer care or banking ombudsman."},
  {"id": 38, "topic": "Telecommunication mobile internet service tower network connectivity", "content": "Telecom regulatory authority handles telecommunications issues. Report service problems, network issues, billing complaints, tower problems. Contact service provider or TRAI."},
  {"id": 39, "topic": "Consumer protection product service quality complaint fraud", "content": "Consumer protection forum handles product and service quality issues. Report defective products, service fraud, quality complaints. Contact consumer court or protection authority."},
  {"id": 40, "topic": "Agriculture farming crop irrigation subsidy scheme fertilizer", "content": "Agriculture department handles farming support and schemes. Report crop problems, irrigation issues, subsidy delays, fertilizer quality. Contact agriculture office or krishi vigyan kendra."},
  {"id": 41, "topic": "Road construction maintenance repair traffic diversion safety", "content": "Public works department handles road construction and maintenance. Report construction delays, safety issues, traffic problems, poor quality work. Contact PWD office or municipal engineering department."},
  {"id": 42, "topic": "Bus shelter maintenance cleanliness lighting safety passenger", "content": "Transport department manages bus shelter facilities. Report damaged shelters, poor lighting, cleanliness issues, safety concerns. Contact transport authority or municipal corporation."},
  {"id": 43, "topic": "Public WiFi internet connectivity access digital service", "content": "Municipal IT department handles public WiFi services. Report connectivity issues, access problems, service disruption. Contact IT cell or municipal corporation with location details."},
  {"id": 44, "topic": "CCTV surveillance security camera monitoring public safety", "content": "Police or municipal corporation manages CCTV surveillance systems. Report non-functional cameras, security concerns, monitoring issues. Contact police station or municipal IT department."},
  {"id": 45, "topic": "Accessibility disabled ramp lift barrier-free infrastructure", "content": "Municipal engineering ensures accessibility for disabled persons. Report missing ramps, non-functional lifts, accessibility barriers. Contact engineering department or disability welfare office."},
  {"id": 46, "topic": "Encroachment illegal occupation public land footpath road", "content": "Municipal enforcement cell handles encroachment issues. Report illegal occupation of public spaces, unauthorized structures, footpath encroachment. Contact enforcement department with location details."},
  {"id": 47, "topic": "Mosquito breeding control health disease prevention sanitation", "content": "Health department manages mosquito control and disease prevention. Report breeding sites, stagnant water, health hazards. Contact health helpline or municipal health officer."},
  {"id": 48, "topic": "Pension welfare scheme elderly disabled benefit payment", "content": "Social welfare department manages pension and welfare schemes. Report payment delays, scheme enrollment issues, benefit problems. Contact welfare office or district collector."},
  {"id": 49, "topic": "Street vendor license regulation market trade business", "content": "Municipal trade license department regulates street vendors. Report licensing issues, illegal vendors, market regulation problems. Contact licensing authority or municipal enforcement."},
  {"id": 50, "topic": "Cultural heritage monument maintenance preservation tourism", "content": "Archaeological survey or tourism department manages heritage sites. Report maintenance issues, damage, preservation concerns. Contact heritage department or tourism office."}
]